CI4-PHP/projeto-modulo-3/app/Controllers/Clientes.php

    public function index()
    {
        $clientes = $this->cliente_model->FindAll();
---
SELECT *
FROM `clientes`

    public function editar($id_cliente)
    {
        $cliente = $this->cliente_model
                        ->where('id_cliente', $id_cliente)
                        ->first();
---
SELECT *
FROM `clientes`
WHERE `id_cliente` = '2'
 LIMIT 1

    public function store()
    {
        $dados = $this->request->getVar();

        if(isset($dados['id_cliente'])):

            $this->cliente_model
                    ->where('id_cliente', $dados['id_cliente'])
                    ->set($dados)
                    ->update();
---
UPDATE `clientes` SET `nome` = 'maria valdeme', `data_de_nascimento` = '2024-03-30', `telefone` = '11996913599', `endereco` = 'Rua São Lázaro', `limite_de_credito` = '2000', `id_cliente` = '2'
WHERE `id_cliente` = '2'