CI4-PHP/projeto-modulo-3/app/Controllers/Funcionarios.php

SELECT *
FROM `funcionarios`
---
    public function index()
    {
        $data['funcionarios'] = $this->funcionario_model
                                                    ->findAll();

SELECT *
FROM `funcionarios`
WHERE `id_funcionario` = '1'
 LIMIT 1
---
    public function editar($id_funcionario)
    {
        $data['funcionario'] = $this->funcionario_model
                                    ->where('id_funcionario', $id_funcionario)
                                    ->first();