CI4-PHP/projeto-modulo-3/app/Controllers/Produtos.php

    public function index()
    {
        $data['produtos'] = $this->produto_model
                                ->findAll();
---
SELECT *
FROM `produtos`